evidence/OPS-2201/k6-before-run3.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: load-tests/reproduce-OPS-2201.js
        output: -

     scenarios: (100.00%) 1 scenario, 200 max VUs, 1m0s max duration (incl. graceful stop):
              * shift_change_search: 200 looping VUs for 30s (gracefulStop: 30s)


running (0m01.0s), 200/200 VUs, 27 complete and 0 interrupted iterations
shift_change_search   [   3% ] 200 VUs  01.0s/30s

running (0m02.0s), 200/200 VUs, 62 complete and 0 interrupted iterations
shift_change_search   [   7% ] 200 VUs  02.0s/30s

running (0m03.0s), 200/200 VUs, 97 complete and 0 interrupted iterations
shift_change_search   [  10% ] 200 VUs  03.0s/30s

running (0m04.0s), 200/200 VUs, 136 complete and 0 interrupted iterations
shift_change_search   [  13% ] 200 VUs  04.0s/30s

running (0m05.0s), 200/200 VUs, 171 complete and 0 interrupted iterations
shift_change_search   [  17% ] 200 VUs  05.0s/30s

running (0m06.0s), 200/200 VUs, 208 complete and 0 interrupted iterations
shift_change_search   [  20% ] 200 VUs  06.0s/30s

running (0m07.0s), 200/200 VUs, 241 complete and 0 interrupted iterations
shift_change_search   [  23% ] 200 VUs  07.0s/30s

running (0m08.0s), 200/200 VUs, 278 complete and 0 interrupted iterations
shift_change_search   [  27% ] 200 VUs  08.0s/30s

running (0m09.0s), 200/200 VUs, 311 complete and 0 interrupted iterations
shift_change_search   [  30% ] 200 VUs  09.0s/30s

running (0m10.0s), 200/200 VUs, 349 complete and 0 interrupted iterations
shift_change_search   [  33% ] 200 VUs  10.0s/30s

running (0m11.0s), 200/200 VUs, 386 complete and 0 interrupted iterations
shift_change_search   [  37% ] 200 VUs  11.0s/30s

running (0m12.0s), 200/200 VUs, 421 complete and 0 interrupted iterations
shift_change_search   [  40% ] 200 VUs  12.0s/30s

running (0m13.0s), 200/200 VUs, 455 complete and 0 interrupted iterations
shift_change_search   [  43% ] 200 VUs  13.0s/30s

running (0m14.0s), 200/200 VUs, 489 complete and 0 interrupted iterations
shift_change_search   [  47% ] 200 VUs  14.0s/30s

running (0m15.0s), 200/200 VUs, 522 complete and 0 interrupted iterations
shift_change_search   [  50% ] 200 VUs  15.0s/30s

running (0m16.0s), 200/200 VUs, 557 complete and 0 interrupted iterations
shift_change_search   [  53% ] 200 VUs  16.0s/30s

running (0m17.0s), 200/200 VUs, 591 complete and 0 interrupted iterations
shift_change_search   [  57% ] 200 VUs  17.0s/30s

running (0m18.0s), 200/200 VUs, 628 complete and 0 interrupted iterations
shift_change_search   [  60% ] 200 VUs  18.0s/30s

running (0m19.0s), 200/200 VUs, 662 complete and 0 interrupted iterations
shift_change_search   [  63% ] 200 VUs  19.0s/30s

running (0m20.0s), 200/200 VUs, 693 complete and 0 interrupted iterations
shift_change_search   [  67% ] 200 VUs  20.0s/30s

running (0m21.0s), 200/200 VUs, 727 complete and 0 interrupted iterations
shift_change_search   [  70% ] 200 VUs  21.0s/30s

running (0m22.0s), 200/200 VUs, 762 complete and 0 interrupted iterations
shift_change_search   [  73% ] 200 VUs  22.0s/30s

running (0m23.0s), 200/200 VUs, 796 complete and 0 interrupted iterations
shift_change_search   [  77% ] 200 VUs  23.0s/30s

running (0m24.0s), 200/200 VUs, 831 complete and 0 interrupted iterations
shift_change_search   [  80% ] 200 VUs  24.0s/30s

running (0m25.0s), 200/200 VUs, 867 complete and 0 interrupted iterations
shift_change_search   [  83% ] 200 VUs  25.0s/30s

running (0m26.0s), 200/200 VUs, 903 complete and 0 interrupted iterations
shift_change_search   [  87% ] 200 VUs  26.0s/30s

running (0m27.0s), 200/200 VUs, 934 complete and 0 interrupted iterations
shift_change_search   [  90% ] 200 VUs  27.0s/30s

running (0m28.0s), 200/200 VUs, 967 complete and 0 interrupted iterations
shift_change_search   [  93% ] 200 VUs  28.0s/30s

running (0m29.0s), 200/200 VUs, 1002 complete and 0 interrupted iterations
shift_change_search   [  97% ] 200 VUs  29.0s/30s

running (0m30.0s), 200/200 VUs, 1038 complete and 0 interrupted iterations
shift_change_search   [ 100% ] 200 VUs  30.0s/30s

running (0m31.0s), 167/200 VUs, 1071 complete and 0 interrupted iterations
shift_change_search ↓ [ 100% ] 200 VUs  30s

running (0m32.0s), 132/200 VUs, 1106 complete and 0 interrupted iterations
shift_change_search ↓ [ 100% ] 200 VUs  30s

running (0m33.0s), 098/200 VUs, 1140 complete and 0 interrupted iterations
shift_change_search ↓ [ 100% ] 200 VUs  30s

running (0m34.0s), 065/200 VUs, 1173 complete and 0 interrupted iterations
shift_change_search ↓ [ 100% ] 200 VUs  30s

running (0m35.0s), 029/200 VUs, 1209 complete and 0 interrupted iterations
shift_change_search ↓ [ 100% ] 200 VUs  30s


  █ THRESHOLDS 

    http_req_duration
    ✗ 'p(95)<300' p(95)=7.47s


  █ TOTAL RESULTS 

    checks_total.......: 1238    34.556925/s
    checks_succeeded...: 100.00% 1238 out of 1238
    checks_failed......: 0.00%   0 out of 1238

    ✓ status is 200

    HTTP
    http_req_duration..............: min=196.43ms med=5.8s avg=5.32s p(90)=5.9s p(95)=7.47s p(99)=10.26s max=10.97s
      { expected_response:true }...: min=196.43ms med=5.8s avg=5.32s p(90)=5.9s p(95)=7.47s p(99)=10.26s max=10.97s
    http_req_failed................: 0.00%  0 out of 1238
    http_reqs......................: 1238   34.556925/s

    EXECUTION
    iteration_duration.............: min=197.34ms med=5.8s avg=5.32s p(90)=5.9s p(95)=7.47s p(99)=10.27s max=10.97s
    iterations.....................: 1238   34.556925/s
    vus............................: 29     min=29        max=200
    vus_max........................: 200    min=200       max=200

    NETWORK
    data_received..................: 4.5 GB 126 MB/s
    data_sent......................: 129 kB 3.6 kB/s



running (0m35.8s), 000/200 VUs, 1238 complete and 0 interrupted iterations
shift_change_search ✓ [ 100% ] 200 VUs  30s
time="2026-08-12T06:45:09+03:00" level=error msg="thresholds on metrics 'http_req_duration' have been crossed"